myrottenpotatoes/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" ORDER BY "movies"."title" ASC
---
 def index
	@movies = Movie.order(:title).all

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
---
 def show
  id = params[:id] # retrieve movie ID from URI route
  begin
     @movie = Movie.find(id) # look up movie by unique ID

INSERT INTO "movies" ("title", "rating", "description", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "y"], ["rating", "G"], ["description", ""], ["release_date", "2021-08-21 00:00:00"], ["created_at", "2021-08-21 12:47:20.069771"], ["updated_at", "2021-08-21 12:47:20.069771"]]
---
 def create
      @movie = Movie.create!(movie_params)

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
UPDATE "movies" SET "description" = ?, "release_date" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["description", ""], ["release_date", "2016-08-21 00:00:00"], ["updated_at", "2021-08-21 13:04:27.754497"], ["id", 13]]
---
 def update
  @movie = Movie.find params[:id]
  @movie.update(movie_params)